app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Books"], ["room_number", 1115]]
---
    def create
        sc = SchoolClass.create((params.require(:school_class).permit(:title, :room_number)))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Notey notes"], ["id", 2]]
---
    def update
        sc = SchoolClass.find(params[:id])
        sc.update((params.require(:school_class).permit(:title, :room_number)))