app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "SSS"], ["last_name", "gg"], ["created_at", "2020-12-14 23:11:44.718065"], ["updated_at", "2020-12-14 23:11:44.718065"]]
---
    def create
        @student = Student.create((params.require(:student).permit(:first_name, :last_name)))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Snuibs"], ["updated_at", "2020-12-14 23:32:06.455342"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update((params.require(:student).permit(:first_name, :last_name)))